# items_list = ['p', 'y', 't', 'h', 'o', 'n']
#
# for item in items_list:
#     print(item)

#--------------------------------------------
# ex_gfs = ["Иветта", "Лизетта", "Мюзетта", "Жанетта", "Жоржетта"]
#
# for ex in ex_gfs:
#     print(ex)
#
# print("Покуда я с вами - клянусь, моя песня не спета")

#--------------------------------------------------------------------
# reasons = ["ты", "все твои мечты", "боль"]
# num = 1
#
# for reason in reasons:
#     print(f"{num} причина - это {reason}")
#     num += 1

#--------------------------------------------------------------------
# words = ["воронка", "лавировали", "тележка", "маленький"]
#
# for word in words:
#     if "р" in word:
#         print(f"{word} - картавое слово")

#----------------------------------------------------------------------
"""
Дан список трат, суммировать их и вывести общие расходы
"""

expenses = [200, 450, 320, 1100, 650, 280, 325, 490, 830, 420]
total = 0

for payment in expenses:
    total += payment

print(f"Всего потрачено: {total}")
