my_list_1 = ["deer", "bear", "rabbit", "butterfly"]

my_list_2  = [1, 2, 3, 4, 5]

print(my_list_1)

print(my_list_2)

print(type([1, 2, 3, 4, 5]))

# -----------------------------------------------------------------

# Нумерация списков

#  -6   -5   -4   -3   -2   -1                   # отрицательный номер индекса

# ['P', 'y', 't', 'h', 'o', 'n']

#   0,   1,   2,   3,   4,   5

# -----------------------------------------------------------------

hp_books = ["Философский камень", "Тайная комната", "Узник Азкабана"]
print(hp_books[2])   # достаем книгу с индексом 2 => 3 книга по счету

#-------------------------------------------------------------------

weather = [4, 5, 5, 3, 5, 7, 5, 7, 4, 4, 5, 5, 3, 5, 7, 5, 7, 4, 9, 7, 4, 4, 5, 5, 3, 5, 7, 5, 7, 4, 4]
date = int(input("Введите дату: "))

print(weather[date - 1])

# ------------------------------------------------------------------

guests = ['Alice', 'Bob', 'Charlie', 'David']

print(guests[-1])
print(guests[-4])
