bring_ring = ['Арагон', 'Фродо', 'Гэндальф', 'Гимли']  # append
bring_ring.append('Леголас')

print(bring_ring)

# ----------------------------------------------------

digits = [1, 2, 3]
digits.append(4)

print(digits)

# -----------------------------------------------------

brhd_ring = ["Арагорн", "Фродо", "Гэндальф", "Гимли"]  # extend
brhd_ring.extend(["Леголас", "Боромир"])
print(brhd_ring)

# -----------------------------------------------------
"""
Написать программу, которая в зависимости от пользовательского ввода дополняет исходный список. Вначале в списке
всегда яблоки и молоко, но если мы идем на пикник - там будут шашлыки и дрова, если в гости - торт и вино, а если 
никуда - мороженку и попкорн
"""

shopping_list = ['яблоки', 'молоко']
num = input("Куда пойдем? ")
if num == 'пикник':
    shopping_list.extend(['шашлык', 'дрова'])
elif num == 'гости':
    shopping_list.extend(['торт', 'вино'])
elif num == 'никуда':
    shopping_list.extend(['мороженку', 'попкорн'])
else:
    print('Не знаю такого места')

print(f"Ваш список покупок: {len(shopping_list)} товара, {shopping_list}")
