# # Буквы можно получать индексами
# s = "Полиформизм"
#
# print(s[9])
# print(s[2])
# print(s[1])

# -------------------------------------
# s = "Алиса, привет"
# # s = "Улиса, привет"
#
# if s[0] == "А":
#     print("Первая буква = a")

# -------------------------------------
# s = "Привет Алиса"
# print(s[0:6]) # --> Привет

# -------------------------------------
# s = "Полиформизм - зло!"
# print(s[-6:]) # -->  - зло!

# -------------------------------------
# s = "Полиформизм - зло!б"
# print(s[1:2]) # --> o

# -------------------------------------
# # Можно посчитать символы в строке через len
# print(len("Мама, я графоман, спасите!"))
#
# # --------------------------------------------
# text = "Мама, я графоман"
#
# if len(text) == 16:
#     print("В тексте 16 букв")
#
# if len(text) > 9:
#     print("Довольно много букв!")

# -------------------------------------------------
# my_str = "Алиса идет гулять в лес"
#
# for i in my_str:
#     print(i)
#
# -------------------------------------------------
# Дана строка, посчитать количество символов и количество слов. Количество слов - это количество пробелов + 1.
# string = "Мама, я графоман, спасите!"
#
# letters_count = 0 # количество всех символов, включая спецсимволы, типа ",", " ", "!"
# words_count = 0 # количество символов
# spaces_count = 0 # количество пробелов
#
# for letter in string:
#     if letter not in [",", " ", "!"]:
#         letters_count += 1
#     elif letter == " ":
#         spaces_count += 1
#
# if spaces_count > 0:
#     words_count = spaces_count + 1
# elif letters_count > 0:
#     words_count = 1
#
# print(f"Букв: {letters_count}")
# print(f"Количество слов: {words_count}")

# -----------------------------------------------------------
# Со стандартного ввода подается название корпорации из трех слов. Составьте строку из первых букв. Используя
# print(...,end="") для вывода значений без переноса строки

# Пример ввода:
#Best
#Update
#Technologies

# Пример вывода:
#BUT

# word_1 = input()
# word_2 = input()
# word_3 = input()
#
# for word in [word_1, word_2, word_3]:
#     print(word[0], end="")

# ------------------------------------------------------------
# # Есть строка. Со стандартного ввода подается индекс. Получите символы на соответствующем месте и выведите его.
# words = "ABCDEFGHIJK"
# index = int(input())
# print(words[index])

#-----------------------------------------------------------------
# # Есть строка. Со стандартного ввода подаются три индекса. Получите символы на соответствующих местах и выведите их.
# words = "ABCDEFGHIJK"
#
# idx_1 = int(input())
# idx_2 = int(input())
# idx_3 = int(input())
#
# print(words[idx_1])
# print(words[idx_2])
# print(words[idx_3])

# ------------------------------------------------------------------
# # Есть строка. Выведите ее с помощью цикла по одной букве на каждой строке
# words = "PYTHONIC"
#
# for i in words:
#     print(i)

# ------------------------------------------------------------------
# # Есть строка. Выведите с помощью цикла все символы, кроме пробелов.
# # Чтобы вывести символы на одной строке, используйте print(..., end="")
# line = "STRINGS ARE AWESOME"
# line_ = []
#
# for i in line:
#     if i != " ":
#         print(i, end="")
#
# -----------------------------------------------------------------
# # Ввести n-значное число. Выведите последовательность, состоящую из 0 и 1. Остальные символы можно отбросит
# line = input()
#
# for i in line:
#     if i == "0" or i == "1":
#         print(i, end="")

# --------------------------------------------------------------------
# # Со стандартного ввода подается строка, состоящая из цифр. Просуммируйте цифры и выведите ответ. Помните, что кусочек строки - тоже строка
# numbers = input()
# result = 0
#
# for num in numbers:
#     result += int(num)
# print(result)

# ----------------------------------------------------------------------
# # Есть 3 строки. Выведите длину каждой из них на новой строке, а затем выведите общую длину всех строк
# line_1 = "Python"
# line_2 = "Uniform"
# line_3 = "Alfa"
# result = 0
#
# print(len(line_1))
# print(len(line_2))
# print(len(line_3))
# print(len(line_1) + len(line_2) + len(line_3))

# ---------------------------------------------------------------------------
# # Получить часть строки можно с помощью метода split. Например, мы можем разбить строку по собачке, запятой, точке или пробелу
# s = "Альфа, Браво, Чарли"
# s = s.split(", ")                                                    # split()
# print(s, type(s))
#
# s_1 = "john_man@gmail.com"
# s_1 = s_1.split("@")
# print(s_1)
# print(s_1[0])
#
# s_2 = "docs.google.com"
# s_2 = s_2.split(".")
# print(s_2)

# -------------------------------------------------------------------------------
# # Метод join() служит для склеивания строк
# color = ['red', 'green', 'blue']                                    # join()
#
# print(' '.join(color))
# print('/'.join(color))
# print(', '.join(color))
# print('.'.join(color))
# print('***'.join(color))
# print(' или '.join(color))

# --------------------------------------------------------------------------------
# # Дан текст, если в строке встречается слово, которое начинается с @ или # внести в новый список, где упомянуты люди и теги
# message = """
# Всем привет, кто пришел изучать #питон и добро пожаловать в чат!
# Будем тут общаться, учиться, делать приложения вместе с @happysnake, @angrycoder, @mewton
# """
#
# people_mentioned = []
# tags_mentioned = []
#
# text = message.replace(",", "")                                # replace(", ", " ") - замена символа
# #print(text)
# words = text.split(" ")
# #print(words)
#
# for word in words:
#     if word[0] == "@":
#         people_mentioned.append(word)
#     elif word[0] == "#":
#         tags_mentioned.append(word)
#
# people_mentioned_joined = " ".join(people_mentioned)
# tags_mentioned_joined = " ".join(tags_mentioned)
#
# print(f"Упомянуты люди: {people_mentioned_joined}")
# print(f"Упомянуты теги: {tags_mentioned_joined}")

# -----------------------------------------------------
# # Разделение строк: Со стандартного ввода поступает фраза, разделенная пробелами. Разделите фразу по пробелам и выведите
# # каждое слово на отдельной строке
#
# words = input()
# words = words.split(" ")
#
# print("\n".join(words))

# ------------------------------------------------------
# # Со стандартного ввода поступает в виде строки последовательность чисел, разделенная пробелами. Разделите строку по
# # пробелам и просуммируйте числа. Выведите сумму в виде целого числа
#
# numbers = input()
# numbers = numbers.split(" ")
# res = 0
#
# for num in numbers:
#     res += int(num)
#
# print(res)

# --------------------------------------------------------
codes = "Надежда Ателло Тарас Олег"
codes = codes.split(" ")

for code in codes:
    print(code[0], end='')